[M_ClaptrapApprentice MissionDefinition]
MissionSummary="Witness Claptrap's awesome magical skills."

[M_ClaptrapApprentice:KillBadAssGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Kill badass giant burning brooms"

[M_ClaptrapApprentice:KillBrooms MissionObjectiveDefinition]
ProgressMessage="Kill brooms"

[M_ClaptrapApprentice:KillFireBrooms MissionObjectiveDefinition]
ProgressMessage="Kill burning brooms"

[M_ClaptrapApprentice:KillGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Kill giant burning brooms"

[M_ClaptrapApprentice:ObjSet_KillBrooms MissionObjectiveSetDefinition]
MissionDescriptionOverride="With his magical beard and wand at the ready, Claptrap has decided to finally test out his prowess as a sorcerer. <br>Claptrap intended to summon a giant demon that he could do battle with. Because he is utterly incompetent, however, Claptrap accidentally summoned a few sentient brooms. You'd better destroy them."
